import React from 'react'
import H1 from './H1'
import H2 from './H2'
import H3 from './H3'
import H4 from './H4'
import H5 from './H5'
import Paragraph from './Paragraph'
import Small from './Small'

export default { title: 'Typography' }

export const h1 = () => <H1>عنوان متن</H1>
export const h2 = () => <H2>عنوان متن</H2>
export const h3 = () => <H3>عنوان متن</H3>
export const h4 = () => <H4>عنوان متن</H4>
export const h5 = () => <H5>عنوان متن</H5>
export const paragraph = () => (
  <Paragraph>
    این یک متن نمایشی است که برای نشان دادن محتوای این مثال استفاده شده است.
  </Paragraph>
)
export const small = () => <Small>متن کوچک</Small>

export const all = () => (
  <div>
    <H1>عنوان متن</H1>
    <Paragraph>
      این یک متن نمایشی است که برای نشان دادن محتوای این مثال استفاده شده
      است.این یک متن نمایشی است که برای نشان دادن محتوای این مثال استفاده شده
      است.
    </Paragraph>
    <H2>عنوان متن</H2>
    <Paragraph>
      این یک متن نمایشی است که برای نشان دادن محتوای این مثال استفاده شده
      است.این یک متن نمایشی است که برای نشان دادن محتوای این مثال استفاده شده
    </Paragraph>
    <H3>عنوان متن</H3>
    <Paragraph>
      این یک متن نمایشی است که برای نشان دادن محتوای این مثال استفاده شده
      است.این یک متن نمایشی است که برای نشان دادن محتوای این مثال استفاده شده
    </Paragraph>
    <H4>عنوان متن</H4>
    <Paragraph>
      این یک متن نمایشی است که برای نشان دادن محتوای این مثال استفاده شده
      است.این یک متن نمایشی است که برای نشان دادن محتوای این مثال استفاده شده
    </Paragraph>
    <H5>عنوان متن</H5>
    <Paragraph>
      این یک متن نمایشی است که برای نشان دادن محتوای این مثال استفاده شده
      است.این یک متن نمایشی است که برای نشان دادن محتوای این مثال استفاده شده
    </Paragraph>
    <Small>متن کوچک</Small>
    <Paragraph>
      این یک متن نمایشی است که برای نشان دادن محتوای این مثال استفاده شده
      است.این یک متن نمایشی است که برای نشان دادن محتوای این مثال استفاده شده
    </Paragraph>
  </div>
)
